# Relatório de Análise V

In [64]:
import pandas as pd

In [65]:
dados = pd.read_csv('aluguel_residencial.csv', sep = ';')

In [66]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

In [67]:
dados.isnull()
# Nos apresenta em valores booleanos se o dado é null (True) ou não (False).

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False   True
4      False   False    False  False   False  False  False        True   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22575  False   False    False  False   False  False  False       False  False
22576  False   False    False  False   False  False  False       False  False
22577  False   False    False  False   False  False  False       False  False
22578  False   False    False  False   False  False  False       False  False
22579  False   False    False  False   False  False  False       False   True

[22580 rows x 9 columns]

In [68]:
dados.notnull()
# Nos apresenta em valores booleanos se o dado não é null (True) ou se é null (False).

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio   IPTU
0      True    True     True   True    True  True   True        True   True
1      True    True     True   True    True  True   True       False  False
2      True    True     True   True    True  True   True        True   True
3      True    True     True   True    True  True   True        True  False
4      True    True     True   True    True  True   True       False  False
...     ...     ...      ...    ...     ...   ...    ...         ...    ...
22575  True    True     True   True    True  True   True        True   True
22576  True    True     True   True    True  True   True        True   True
22577  True    True     True   True    True  True   True        True   True
22578  True    True     True   True    True  True   True        True   True
22579  True    True     True   True    True  True   True        True  False

[22580 rows x 9 columns]

In [69]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22580 non-null  object
 1   Bairro      22580 non-null  object
 2   Quartos     22580 non-null  int64
 3   Vagas       22580 non-null  int64
 4   Suites      22580 non-null  int64
 5   Area        22580 non-null  int64
 6   Valor       22571 non-null  float64
 7   Condominio  20765 non-null  float64
 8   IPTU        15795 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

In [70]:
dados[dados['Valor'].isnull()]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
58,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
1492,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
1683,Casa,Campo Grande,3,4,3,363,NaN,NaN,NaN
2012,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
2034,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
4941,Casa,Campo Grande,3,2,1,100,NaN,NaN,NaN
8568,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
8947,Apartamento,Glória,3,0,1,135,NaN,910.0,228.0
9149,Apartamento,Gávea,3,1,1,105,NaN,880.0,221.0

Poderíamos apenas passar _dados['Valor'].isnull()_ e ver em uma Series as linhas com valores nulos na coluna Valor.
Para visualizar dentro do banco de dados, podemos passar esse filtro, dentro de _dados[dados['Valor'].isnull()]_

Como trabalhamos com a informação, ter valores nulos no nosso banco de dados não nos ajuda em nada. Por isso, podemos eliminar essas linhas que contém valores nulos.

In [71]:
A = dados.shape[0]
A

22580

In [72]:
dados.dropna(subset = ['Valor'], inplace = True)
# .dropna() para eliminar todas as frequências que contem valores nulos.
# subset é uma lista com as colunas que queremos fazer o drop

In [73]:
B = dados.shape[0]
B

22571

In [74]:
A - B

9

In [75]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

## Tratamento de Dados Faltantes (continuação)

No banco de dados, há apartamentos com IPTU e Condomínio com valores nulos, mas também há casas e outros tipos de residencias que hão de ter valores nulos. Por isso, tudo que for apartamento e ter valor nulo em condomínio, será apagado, o restante, será preenchido com 0 (zero).

In [76]:
dados[dados['Condominio'].isnull()].shape[0]

1813

In [77]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())
# Nosso filtro com os dados que não queremos: Apartamentos com valores nulos em condomínio

In [78]:
A = dados.shape[0]
A

22571

In [79]:
dados = dados[~selecao]
# Por isso, salvamos na var dados o contrário de selecao, ou sejá, todos os Apartamentos e outros tipos de imóveis que não
# tem valores nulos em condomínio

In [80]:
B = dados.shape[0]
B

21826

In [81]:
A - B

745

Podemos conferir e agora, todos os campos de condomínio que tem valores nulos são de outros tipo de residencias, que não possuem condomínio. Por isso, vamos preencher com o valor 0.

In [82]:
dados[dados['Condominio'].isnull()].shape[0]

1068

In [83]:
# Para preencher um campo nulo podemos fazr de duas formas:
# 1º forma: dados.fillna(0, inplace = True) ou...
dados = dados.fillna({'Condominio':0, 'IPTU':0})
# Dessa segunda forma, podemos atribuir valores diferentes para os campos.

In [85]:
# Agora não há nenhum campo em condominio com valores nulos
dados[dados['Condominio'].isnull()].shape[0]

0

In [91]:
dados[dados['IPTU'].isnull()].shape[0]

0

In [92]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  21826 non-null  float64
 8   IPTU        21826 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

Portanto, agora, podemos exportar esse arquivo e substituir o aluguel_residencial.csv, pois, agora podemos trabalhar com a certeza de ter todos os dados nas ocorrências analisadas.

In [93]:
dados.to_csv('aluguel_residencial.csv', sep = ';', index = False)